{"keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"config": {"bias_regularizer": null, "kernel_size": [3, 3], "batch_input_shape": [null, 100, 100, 1], "strides": [1, 1], "activation": "relu", "kernel_constraint": null, "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "padding": "valid", "trainable": true, "data_format": "channels_last", "filters": 32, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "activation": "relu", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "padding": "valid", "trainable": true, "data_format": "channels_last", "filters": 32, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "activity_regularizer": null, "name": "dense_1", "activation": "relu", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "units": 128}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "activity_regularizer": null, "name": "dense_2", "activation": "softmax", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "units": 5}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow"}